[Killed] BlockStatement
w/kata-ts-gilded-rose/src/main.ts:6:62
   sellIn: number;
   quality: number;
 
-  constructor(name: string, sellIn: number, quality: number) {
-    this.name = name;
-    this.sellIn = sellIn;
-    this.quality = quality;
-  }
+  constructor(name: string, sellIn: number, quality: number) {}
 }
 

[Timeout] BlockStatement
w/kata-ts-gilded-rose/src/main.ts:16:42
 export class GildedRose {
   items: Array<Item>;
 
-  constructor(items = [] as Array<Item>) {
-    this.items = items;
-  }
+  constructor(items = [] as Array<Item>) {}
 
   updateQuality(): Item[] {

[Timeout] ArrayDeclaration
w/kata-ts-gilded-rose/src/main.ts:16:23
 export class GildedRose {
   items: Array<Item>;
 
-  constructor(items = [] as Array<Item>) {
+  constructor(items = ["Stryker was here"] as Array<Item>) {
     this.items = items;
   }

[Timeout] EqualityOperator
w/kata-ts-gilded-rose/src/main.ts:21:21
   }
 
   updateQuality(): Item[] {
-    for (let i = 0; i < this.items.length; i++) {
+    for (let i = 0; i <= this.items.length; i++) {
       if (
         this.items[i].name != "Aged Brie" &&

[Timeout] EqualityOperator
w/kata-ts-gilded-rose/src/main.ts:21:21
   }
 
   updateQuality(): Item[] {
-    for (let i = 0; i < this.items.length; i++) {
+    for (let i = 0; i >= this.items.length; i++) {
       if (
         this.items[i].name != "Aged Brie" &&

[Killed] ConditionalExpression
w/kata-ts-gilded-rose/src/main.ts:23:9
   updateQuality(): Item[] {
     for (let i = 0; i < this.items.length; i++) {
       if (
-        this.items[i].name != "Aged Brie" &&
+        true &&
         this.items[i].name != "Backstage passes to a TAFKAL80ETC concert"
       ) {

[Killed] LogicalOperator
w/kata-ts-gilded-rose/src/main.ts:23:9
   updateQuality(): Item[] {
     for (let i = 0; i < this.items.length; i++) {
       if (
-        this.items[i].name != "Aged Brie" &&
-        this.items[i].name != "Backstage passes to a TAFKAL80ETC concert"
+        this.items[i].name != "Aged Brie" || this.items[i].name != "Backstage passes to a TAFKAL80ETC concert"
       ) {
         if (this.items[i].quality > 0) {

[Timeout] EqualityOperator
w/kata-ts-gilded-rose/src/main.ts:24:9
     for (let i = 0; i < this.items.length; i++) {
       if (
         this.items[i].name != "Aged Brie" &&
-        this.items[i].name != "Backstage passes to a TAFKAL80ETC concert"
+        this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"
       ) {
         if (this.items[i].quality > 0) {

[Timeout] ConditionalExpression
w/kata-ts-gilded-rose/src/main.ts:24:9
     for (let i = 0; i < this.items.length; i++) {
       if (
         this.items[i].name != "Aged Brie" &&
-        this.items[i].name != "Backstage passes to a TAFKAL80ETC concert"
+        false
       ) {
         if (this.items[i].quality > 0) {

[Timeout] BlockStatement
w/kata-ts-gilded-rose/src/main.ts:25:9
       if (
         this.items[i].name != "Aged Brie" &&
         this.items[i].name != "Backstage passes to a TAFKAL80ETC concert"
-      ) {
-        if (this.items[i].quality > 0) {
-          if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
-            this.items[i].quality = this.items[i].quality - 1;
-          }
-        }
-      } else {
+      ) {} else {
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1;

[Killed] EqualityOperator
w/kata-ts-gilded-rose/src/main.ts:26:13
         this.items[i].name != "Aged Brie" &&
         this.items[i].name != "Backstage passes to a TAFKAL80ETC concert"
       ) {
-        if (this.items[i].quality > 0) {
+        if (this.items[i].quality <= 0) {
           if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
             this.items[i].quality = this.items[i].quality - 1;

[Killed] BlockStatement
w/kata-ts-gilded-rose/src/main.ts:26:40
         this.items[i].name != "Aged Brie" &&
         this.items[i].name != "Backstage passes to a TAFKAL80ETC concert"
       ) {
-        if (this.items[i].quality > 0) {
-          if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
-            this.items[i].quality = this.items[i].quality - 1;
-          }
-        }
+        if (this.items[i].quality > 0) {}
       } else {
         if (this.items[i].quality < 50) {

[Timeout] ConditionalExpression
w/kata-ts-gilded-rose/src/main.ts:27:15
         this.items[i].name != "Backstage passes to a TAFKAL80ETC concert"
       ) {
         if (this.items[i].quality > 0) {
-          if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
+          if (true) {
             this.items[i].quality = this.items[i].quality - 1;
           }

[Timeout] BlockStatement
w/kata-ts-gilded-rose/src/main.ts:27:67
         this.items[i].name != "Backstage passes to a TAFKAL80ETC concert"
       ) {
         if (this.items[i].quality > 0) {
-          if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
-            this.items[i].quality = this.items[i].quality - 1;
-          }
+          if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {}
         }
       } else {

[Timeout] ArithmeticOperator
w/kata-ts-gilded-rose/src/main.ts:28:37
       ) {
         if (this.items[i].quality > 0) {
           if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
-            this.items[i].quality = this.items[i].quality - 1;
+            this.items[i].quality = this.items[i].quality + 1;
           }
         }

[Timeout] BlockStatement
w/kata-ts-gilded-rose/src/main.ts:31:14
             this.items[i].quality = this.items[i].quality - 1;
           }
         }
-      } else {
-        if (this.items[i].quality < 50) {
-          this.items[i].quality = this.items[i].quality + 1;
-          if (
-            this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"
-          ) {
-            if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
-            if (this.items[i].sellIn < 6) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
-          }
-        }
-      }
+      } else {}
       if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
         this.items[i].sellIn = this.items[i].sellIn - 1;

[Killed] EqualityOperator
w/kata-ts-gilded-rose/src/main.ts:32:13
           }
         }
       } else {
-        if (this.items[i].quality < 50) {
+        if (this.items[i].quality >= 50) {
           this.items[i].quality = this.items[i].quality + 1;
           if (

[Killed] BlockStatement
w/kata-ts-gilded-rose/src/main.ts:32:41
           }
         }
       } else {
-        if (this.items[i].quality < 50) {
-          this.items[i].quality = this.items[i].quality + 1;
-          if (
-            this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"
-          ) {
-            if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
-            if (this.items[i].sellIn < 6) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
-          }
-        }
+        if (this.items[i].quality < 50) {}
       }
       if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {

[Killed] ArithmeticOperator
w/kata-ts-gilded-rose/src/main.ts:33:35
         }
       } else {
         if (this.items[i].quality < 50) {
-          this.items[i].quality = this.items[i].quality + 1;
+          this.items[i].quality = this.items[i].quality - 1;
           if (
             this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"

[Killed] ConditionalExpression
w/kata-ts-gilded-rose/src/main.ts:35:13
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1;
           if (
-            this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"
+            true
           ) {
             if (this.items[i].sellIn < 11) {

[Timeout] EqualityOperator
w/kata-ts-gilded-rose/src/main.ts:35:13
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1;
           if (
-            this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"
+            this.items[i].name != "Backstage passes to a TAFKAL80ETC concert"
           ) {
             if (this.items[i].sellIn < 11) {

[Timeout] BlockStatement
w/kata-ts-gilded-rose/src/main.ts:36:13
           this.items[i].quality = this.items[i].quality + 1;
           if (
             this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"
-          ) {
-            if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
-            if (this.items[i].sellIn < 6) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
-          }
+          ) {}
         }
       }

[Timeout] EqualityOperator
w/kata-ts-gilded-rose/src/main.ts:37:17
           if (
             this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"
           ) {
-            if (this.items[i].sellIn < 11) {
+            if (this.items[i].sellIn >= 11) {
               if (this.items[i].quality < 50) {
                 this.items[i].quality = this.items[i].quality + 1;

[Timeout] ConditionalExpression
w/kata-ts-gilded-rose/src/main.ts:37:17
           if (
             this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"
           ) {
-            if (this.items[i].sellIn < 11) {
+            if (false) {
               if (this.items[i].quality < 50) {
                 this.items[i].quality = this.items[i].quality + 1;

[Killed] EqualityOperator
w/kata-ts-gilded-rose/src/main.ts:38:19
             this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"
           ) {
             if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
+              if (this.items[i].quality >= 50) {
                 this.items[i].quality = this.items[i].quality + 1;
               }

[Killed] ConditionalExpression
w/kata-ts-gilded-rose/src/main.ts:38:19
             this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"
           ) {
             if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
+              if (false) {
                 this.items[i].quality = this.items[i].quality + 1;
               }

[Timeout] ConditionalExpression
w/kata-ts-gilded-rose/src/main.ts:42:17
                 this.items[i].quality = this.items[i].quality + 1;
               }
             }
-            if (this.items[i].sellIn < 6) {
+            if (true) {
               if (this.items[i].quality < 50) {
                 this.items[i].quality = this.items[i].quality + 1;

[Timeout] ConditionalExpression
w/kata-ts-gilded-rose/src/main.ts:42:17
                 this.items[i].quality = this.items[i].quality + 1;
               }
             }
-            if (this.items[i].sellIn < 6) {
+            if (false) {
               if (this.items[i].quality < 50) {
                 this.items[i].quality = this.items[i].quality + 1;

[Killed] BlockStatement
w/kata-ts-gilded-rose/src/main.ts:43:47
               }
             }
             if (this.items[i].sellIn < 6) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
+              if (this.items[i].quality < 50) {}
             }
           }

[Killed] EqualityOperator
w/kata-ts-gilded-rose/src/main.ts:43:19
               }
             }
             if (this.items[i].sellIn < 6) {
-              if (this.items[i].quality < 50) {
+              if (this.items[i].quality >= 50) {
                 this.items[i].quality = this.items[i].quality + 1;
               }

[Killed] ConditionalExpression
w/kata-ts-gilded-rose/src/main.ts:50:11
           }
         }
       }
-      if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
+      if (false) {
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }

[Timeout] ConditionalExpression
w/kata-ts-gilded-rose/src/main.ts:50:11
           }
         }
       }
-      if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
+      if (true) {
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }

[Timeout] ArithmeticOperator
w/kata-ts-gilded-rose/src/main.ts:51:32
         }
       }
       if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
-        this.items[i].sellIn = this.items[i].sellIn - 1;
+        this.items[i].sellIn = this.items[i].sellIn + 1;
       }
       if (this.items[i].sellIn < 0) {

[Timeout] EqualityOperator
w/kata-ts-gilded-rose/src/main.ts:53:11
       if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }
-      if (this.items[i].sellIn < 0) {
+      if (this.items[i].sellIn <= 0) {
         if (this.items[i].name != "Aged Brie") {
           if (

[Timeout] EqualityOperator
w/kata-ts-gilded-rose/src/main.ts:53:11
       if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }
-      if (this.items[i].sellIn < 0) {
+      if (this.items[i].sellIn >= 0) {
         if (this.items[i].name != "Aged Brie") {
           if (

[Killed] ConditionalExpression
w/kata-ts-gilded-rose/src/main.ts:54:13
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }
       if (this.items[i].sellIn < 0) {
-        if (this.items[i].name != "Aged Brie") {
+        if (false) {
           if (
             this.items[i].name != "Backstage passes to a TAFKAL80ETC concert"

[Killed] ConditionalExpression
w/kata-ts-gilded-rose/src/main.ts:54:13
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }
       if (this.items[i].sellIn < 0) {
-        if (this.items[i].name != "Aged Brie") {
+        if (true) {
           if (
             this.items[i].name != "Backstage passes to a TAFKAL80ETC concert"

[Killed] ConditionalExpression
w/kata-ts-gilded-rose/src/main.ts:56:13
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != "Aged Brie") {
           if (
-            this.items[i].name != "Backstage passes to a TAFKAL80ETC concert"
+            false
           ) {
             if (this.items[i].quality > 0) {

[Timeout] EqualityOperator
w/kata-ts-gilded-rose/src/main.ts:56:13
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != "Aged Brie") {
           if (
-            this.items[i].name != "Backstage passes to a TAFKAL80ETC concert"
+            this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"
           ) {
             if (this.items[i].quality > 0) {

[Timeout] EqualityOperator
w/kata-ts-gilded-rose/src/main.ts:59:19
             this.items[i].name != "Backstage passes to a TAFKAL80ETC concert"
           ) {
             if (this.items[i].quality > 0) {
-              if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
+              if (this.items[i].name == "Sulfuras, Hand of Ragnaros") {
                 this.items[i].quality = this.items[i].quality - 1;
               }

[Timeout] BlockStatement
w/kata-ts-gilded-rose/src/main.ts:63:18
                 this.items[i].quality = this.items[i].quality - 1;
               }
             }
-          } else {
-            this.items[i].quality =
-              this.items[i].quality - this.items[i].quality;
-          }
+          } else {}
         } else {
           if (this.items[i].quality < 50) {

[Timeout] ArithmeticOperator
w/kata-ts-gilded-rose/src/main.ts:65:15
             }
           } else {
             this.items[i].quality =
-              this.items[i].quality - this.items[i].quality;
+              this.items[i].quality + this.items[i].quality;
           }
         } else {

[Timeout] BlockStatement
w/kata-ts-gilded-rose/src/main.ts:67:16
             this.items[i].quality =
               this.items[i].quality - this.items[i].quality;
           }
-        } else {
-          if (this.items[i].quality < 50) {
-            this.items[i].quality = this.items[i].quality + 1;
-          }
-        }
+        } else {}
       }
     }

[Killed] BlockStatement
w/kata-ts-gilded-rose/src/main.ts:68:43
               this.items[i].quality - this.items[i].quality;
           }
         } else {
-          if (this.items[i].quality < 50) {
-            this.items[i].quality = this.items[i].quality + 1;
-          }
+          if (this.items[i].quality < 50) {}
         }
       }

[Killed] EqualityOperator
w/kata-ts-gilded-rose/src/main.ts:68:15
               this.items[i].quality - this.items[i].quality;
           }
         } else {
-          if (this.items[i].quality < 50) {
+          if (this.items[i].quality <= 50) {
             this.items[i].quality = this.items[i].quality + 1;
           }
